{
  "title": "谷歌数据科学家面试复盘：四轮技术与行为面经验分享",
  "originalContent": "<div class=\"article_body\"><td class=\"t_f\" id=\"postmessage_14943805\" itemprop=\"articleBody\">\n・ I applied for the data Scientist position in the Google Cloud Revenue Acceleration Team. I was referred by a friend and the whole process took about 4 weeks. <br/>\n・ Phase 1: Discussion with the Recruiter I interviewed for the same role one year ago. I didn't get through and the recruiter at that time refused to provide any specific feedback stating that they were not allowed to share. However, when I reapplied, the recruiter was very helpful and basically walked me through an \"approximate\" feedback of how I did last time and what went wrong. <br/>\n・ First technical screen (telephonic): I skipped this part. <br/>\n・ General Cognitive Ability: This interview focused on business case study like questions (2) and lasted 45 minutes. The idea was to <br/>\n・ 1. Understand the question and the context quickly <div id=\"1p3a-ad-thread-paragraph\" style=\"margin-top: 20px; margin-bottom: 20px;\"></div><br/>\n・ 2. Come up with a structured approach towards the solution <br/>\n・ 3. Discuss the questions posed by the interviewer in the middle of the conversation Overall, preparing for the business case interviews helped me for this interview. The interviewer generally focused and asked questions about the technical aspects of the problem and most of the discussion after coming up with the structure was technical in nature (e.g. What are some ways to effectively reduce the dimensionality of the data? Which models you will pick to answer this (classification) problem and why ? Compare the approach with others etc.) <br/>\n・ Technical Round (Stats and ML, 45 minutes): This was relatively easy I would say. The interviewer asked to code a simple problem related to string manipulation and percentile calculation. On the ML bit, most discussion hovered around MLE concepts, CI and Hypothesis testing basics. Overall, not very difficult and the interviewer was very helpful. <br/>\n・ Leadership (45 minutes): In this round , interviewer focused on questions related to leadership experiences in the past and asked for examples showcasing initiative, handling conflicts and pushing / advocating for ideas. The questions were very open ended and the interviewer was very helpful. I suggest writing down 10-15 behavioral questions in advance for practice (which I didn't do). <br/>\n・ Googlyness (45 minutes): This was simply a rehash of Leadership type questions. The interviewer came prepared with 7-8 classic behavior interview questions and asked them one after the other. By the end I was very tired and I suspect this is the interview which DQed me.<br/>\n・ Interview Questions<br/>\n・ Basic MLE, CI and Hypothesis testing. Know it cold.<br/>\n・  Prepare for GCA by doing business case studies<br/>\n・  Write down basic behavior interview questions and prepare good examples for situations<br/>\n</td></div>",
  "processedContent": "## 基本信息（公司/岗位/结果/难度）\n- **公司**：Google\n- **岗位**：数据科学家（Data Scientist）\n- **结果**：未通过（Googlyness 面试疑似被拒）\n- **难度**：4\n\n## 时间线\n- 整个面试流程历时约 4 周。\n- 此前一年曾申请同一岗位但未通过，本次为重新申请。\n- 各轮面试按顺序进行，未提及具体日期。\n\n## 面试过程\n### 招聘方沟通（Recruiter Call）\n- 由内部员工推荐进入流程。\n- 招聘官较支持，提供了上次面试的“近似反馈”，包括表现不足之处，帮助准备本轮面试。\n\n### 第一轮：通用认知能力面试（General Cognitive Ability, 45分钟）\n- 形式：电话面试\n- 内容聚焦于两个商业案例问题，考察：\n  - 快速理解问题背景\n  - 构建结构化解决方案\n  - 在讨论中回应技术性追问\n- 虽为业务导向题型，但后续深入探讨了技术细节，例如：\n  - 如何有效降低数据维度？\n  - 分类问题应选择哪些模型及原因？\n  - 不同方法之间的比较分析\n- 建议提前练习商业案例分析以应对此类题目。\n\n### 第二轮：技术面（统计与机器学习，45分钟）\n- 相对简单，面试官态度友好。\n- 编程部分：实现字符串操作和百分位数计算的简单编码题。\n- 统计与机器学习部分重点考察：\n  - 最大似然估计（MLE）\n  - 置信区间（CI）\n  - 假设检验基础概念\n- 题目不难，强调基础掌握扎实即可。\n\n### 第三轮：领导力行为面（Leadership, 45分钟）\n- 聚焦过往领导经验，要求举例说明：\n  - 主动发起项目或推动变革\n  - 处理团队冲突\n  - 倡导并落地个人想法\n- 问题开放性强，面试官较为配合，给予充分表达空间。\n- 建议提前准备 10–15 道常见行为问题的答案（本人未充分准备）。\n\n### 第四轮：文化匹配面（Googlyness, 45分钟）\n- 内容与领导力轮高度重合，被描述为“行为问题的重复”。\n- 面试官准备了 7–8 道经典行为问题，连续提问，节奏密集。\n- 结束时感到疲惫，怀疑在此轮被淘汰。\n\n## 题目总结\n- 最大似然估计、置信区间、假设检验的基本原理\n- 商业案例分析题（如构建解决路径、模型选择与比较）\n- 数据降维方法\n- 字符串处理编程题\n- 百分位数计算实现\n- 行为问题示例：\n  - 描述一次你主动推动改变的经历\n  - 如何处理团队中的分歧\n  - 举例说明你如何在阻力下坚持推进一个想法\n\n## 个人总结（经验与建议）\n- 提前准备商业案例有助于通用认知能力面试的表现。\n- 技术基础需牢固，尤其是统计学核心概念（MLE、CI、假设检验）要‘烂熟于心’。\n- 强烈建议系统整理常见行为面试题，撰写并演练高质量回答范例。\n- 注意多轮行为面试可能形式相似但考察点略有不同，保持精力集中至关重要。\n- Googlyness 轮次节奏较快，连续作答易疲劳，建议模拟训练提升持久输出能力。",
  "company": "Google",
  "role": "数据科学家",
  "difficulty": 4,
  "tags": [
    "数据科学家",
    "行为面试",
    "商业案例",
    "统计学",
    "机器学习",
    "Google面试",
    "面试失败",
    "系统设计"
  ],
  "comments": [],
  "usefulVotes": 0,
  "uselessVotes": 0,
  "shareCount": 0,
  "isAnonymous": true
}