{
  "title": "谷歌软件工程师面试经验：技术与行为面结合，最终未通过",
  "originalContent": "<div class=\"article_body\"><td class=\"t_f\" id=\"postmessage_15030152\" itemprop=\"articleBody\">\n我是通过内推获得的这次狗家面试 整个过程大约一个月 然而还是凉了 那就把我的面试经验和大家分享下吧 积攒好人卡 求大米！<br/>\nFirst technical screen (telephonic)<br/>\nGeneral Cognitive Ability: This interview focused on business case study like questions (2) and lasted 45 minutes. The idea was to <br/>\n・ 1. Understand the question and the context quickly <div id=\"1p3a-ad-thread-paragraph\" style=\"margin-top: 20px; margin-bottom: 20px;\"></div><br/>\n・ 2. Come up with a structured approach towards the solution <br/>\n<div class=\"locked\">以下内容需要积分高于 200 您已经可以浏览</div><br/>\n<div style=\"border: 1px solid #C2D5E3;padding:8px 8px 8px 24px;\">・ 3. Discuss the questions posed by the interviewer in the middle of the conversation Overall, preparing for the business case interviews helped me for this interview. The interviewer generally focused and asked questions about the technical aspects of the problem and most of the discussion after coming up with the structure was technical in nature (e.g. What are some ways to effectively reduce the dimensionality of the data? Which models you will pick to answer this (classification) problem and why ? Compare the approach with others etc.) <br/>\nTechnical Round (Stats and ML, 45 minutes): This was relatively easy I would say. The interviewer asked to code a simple problem related to string manipulation and percentile calculation. On the ML bit, most discussion hovered around MLE concepts, CI and Hypothesis testing basics. Overall, not very difficult and the interviewer was very helpful. <br/>\nLeadership (45 minutes): In this round , interviewer focused on questions related to leadership experiences in the past and asked for examples showcasing initiative, handling conflicts and pushing / advocating for ideas. The questions were very open ended and the interviewer was very helpful. I suggest writing down 10-15 behavioral questions in advance for practice (which I didn't do).<br/>\nGooglyness (45 minutes): This was simply a rehash of Leadership type questions. The interviewer came prepared with 7-8 classic behavior interview questions and asked them one after the other. By the end I was very tired and I suspect this is the interview which DQed me.<br/>\n<br/>\n・ Interview Questions<br/>\n・ Basic MLE, CI and Hypothesis testing. Know it cold.<br/>\n・  Prepare for GCA by doing business case studies</div><br/>\n<br/>\n・  Write down basic behavior interview questions and prepare good examples for situations<br/>\n</td></div>",
  "processedContent": "## 基本信息（公司/岗位/结果/难度）\n- **公司**：Google\n- **岗位**：软件工程师\n- **结果**：未通过（DQ）\n- **难度**：4\n\n## 时间线\n- 面试流程总时长约一个月\n- 通过内推获得面试机会\n- 各轮面试集中在短时间内完成（具体时间未明确）\n\n## 面试过程\n### 第一轮：技术初筛（电话面试，45分钟）\n- 考察方向：通用认知能力（General Cognitive Ability, GCA）\n- 内容为商业案例分析类问题（共2题）\n- 重点考察：\n  - 快速理解问题与背景\n  - 构建结构化解题思路\n  - 在讨论中回应面试官提问\n- 尽管形式类似商科案例面试，但后续讨论偏技术细节，例如：\n  - 如何有效降低数据维度？\n  - 解决分类问题应选择哪些模型及其原因？\n  - 不同方法的比较分析等\n- 建议提前准备常见的商业案例分析题目\n\n### 第二轮：技术面（统计与机器学习，45分钟）\n- 编程题：字符串操作与百分位数计算（较简单）\n- 机器学习部分主要涉及：\n  - 最大似然估计（MLE）\n  - 置信区间（CI）\n  - 假设检验基础\n- 难度整体不高，面试官态度友好且乐于引导\n\n### 第三轮：领导力面试（45分钟）\n- 聚焦过往领导经历\n- 要求举例说明以下能力：\n  - 主动发起项目或行动\n  - 处理团队冲突\n  - 推动并倡导自身观点\n- 问题开放性强，无固定答案\n- 建议提前准备10–15道常见行为面试题（楼主未充分准备）\n\n### 第四轮：Googlyness 面试（45分钟）\n- 内容与领导力面试高度重合，再次考察行为特质\n- 面试官准备了7–8道经典行为问题，逐一提问\n- 连续作答导致疲劳感明显\n- 楼主怀疑此轮为其被淘汰的关键环节\n\n## 题目总结\n- 最大似然估计、置信区间、假设检验相关基础知识\n- 字符串处理编程题（具体逻辑未详述）\n- 百分位数计算实现\n- 商业案例分析题（如产品设计、策略决策类）\n- 行为面试题包括：\n  - 描述一次你展现领导力的经历\n  - 如何推动一个不被看好的想法？\n  - 如何处理团队中的分歧？\n  - 举例说明你主动解决问题的情境\n\n## 个人总结（经验与建议）\n- GCA 能力可通过练习商业案例题提升\n- 统计与ML基础知识需扎实掌握，尤其是推断统计部分\n- 编程题难度适中，注重清晰实现\n- 行为面试至关重要，务必提前梳理个人经历，准备高质量故事素材\n- 建议书面整理10–15道高频行为问题并反复演练\n- Googlyness 和领导力面试虽内容重复，但仍需保持状态全程投入",
  "company": "Google",
  "role": "软件工程师",
  "difficulty": 4,
  "tags": [
    "技术面试",
    "行为面试",
    "机器学习",
    "统计学",
    "GCA",
    "Googlyness",
    "内推",
    "未通过"
  ],
  "comments": [],
  "usefulVotes": 0,
  "uselessVotes": 0,
  "shareCount": 0,
  "isAnonymous": true
}